{
  "menu": {
    "item2": "Sobre m铆",
    "item3": "Habilidades",
    "item4": "Formaci贸n",
    "item5": "Proyectos",
    "item6": "Contacto"
  },
  "home": {
    "slide1_greeting": "隆Hola! Soy",
    "slide1_title": "Ingeniero en Ciencias de la Computaci贸n",
    "slide1_description": "Ingeniero en Ciencias de la Computaci贸n apasionado por la innovaci贸n y el desarrollo de soluciones tecnol贸gicas.",
    "slide2_title": "Desarrollador Web",
    "slide2_subtitle": "Construyendo soluciones digitales",
    "slide2_description": "Apasionado por crear aplicaciones y sistemas web que optimicen la experiencia del usuario.",
    "slide3_title": "Innovador Digital",
    "slide3_subtitle": "Soluciones para el futuro",
    "slide3_description": "Trabajando con las tecnolog铆as m谩s recientes para mejorar la interacci贸n digital y optimizar procesos.",
    "slide4_title": "Ingeniero y Creativo",
    "slide4_subtitle": "Soluciones tecnol贸gicas",
    "slide4_description": "Enfocado en crear soluciones innovadoras que transformen el mundo digital.",
    "cv_button": "Descargar CV",
    "contact_button": "Contacto"
  },
  "sobre-mi": {
    "title": "Sobre m铆",
    "texto_sobreMi-parrafo1": "Soy Ingeniero en Ciencias de la Computaci贸n con una gran pasi贸n por crear soluciones innovadoras y eficientes. Como joven Shuar, aporto una perspectiva 煤nica que combina determinaci贸n, creatividad y un fuerte sentido de comunidad. A lo largo de mi carrera, me he especializado en dise帽ar sistemas eficientes, optimizar algoritmos e implementar soluciones tecnol贸gicas avanzadas. Mi formaci贸n me ha proporcionado una base s贸lida en arquitectura de software, inteligencia artificial y procesamiento de datos, 谩reas donde me apasiona innovar y aplicar nuevas metodolog铆as.",
    "texto_sobreMi-parrafo2": "M谩s all谩 de los aspectos t茅cnicos, creo firmemente en el impacto positivo de la tecnolog铆a en la sociedad. Me motiva participar en proyectos que transformen industrias y mejoren la vida de las personas mediante el desarrollo de herramientas inteligentes y eficientes. Con una mentalidad de mejora continua, siempre busco la excelencia y nuevas oportunidades para aprender, colaborar y aportar soluciones que generen valor."
  },
  "habilidades": {
    "title": "Habilidades",
    "category1": "Lenguajes de Programaci贸n",
    "category2": "Frameworks y Librer铆as",
    "category3": "Bases de Datos",
    "category4": "Herramientas y Entornos de Desarrollo"
  },
  "formacion": {
    "title": "Formaci贸n",
    "formacion1": "Ingenier铆a en Ciencias de la Computaci贸n - Universidad Polit茅cnica Salesiana",
    "tiempo-formacion1": "2020 - 2025",
    "formacion2": "Bootcamp Rethos - Universidad Polit茅cnica Salesiana",
    "tiempo-formacion2": "Agosto 2024",
    "formacion3": "Colaborador en proyectos tecnol贸gicos y comunitarios - Corporaci贸n UNSA",
    "tiempo-formacion3": "2020 - Actualidad"
  },
  "proyectos": {
    "title": "Proyectos",
    "title-proyecto1": "EmotionLens: Sistema de Reconocimiento de Emociones",
    "info-proyecto1": "Aplicaci贸n m贸vil desarrollada en Android Studio con Java, que utiliza algoritmos de visi贸n por computadora para el reconocimiento facial. Emplea cascadas Haar para detectar rostro, ojos, nariz y boca. Con estos puntos, calcula descriptores (como HOG o similares), los env铆a a un servidor web implementado en Flask, donde un modelo SVM predice la emoci贸n del usuario. Adem谩s, la aplicaci贸n aplica un filtro interactivo (como gafas virtuales) para mejorar la experiencia visual y educativa. Este sistema es ideal para proyectos educativos y de interacci贸n social.",
    "title-proyecto2": "Portafolio Personal",
    "info-proyecto2": "Mi portafolio personal, desarrollado con HTML, CSS y JavaScript, es un espacio donde presento mis proyectos m谩s destacados de manera interactiva, incluyendo despliegues funcionales y enlaces a los repositorios correspondientes. Refleja mi conocimiento en tecnolog铆as como React, Flask, Django, bases de datos como MySQL y MongoDB, y herramientas como Git. El dise帽o es moderno y adaptable, destacando tambi茅n mi formaci贸n acad茅mica, certificaciones y habilidades t茅cnicas tanto en desarrollo frontend como backend, consolidando mi experiencia en programaci贸n y desarrollo web.",
    "title-proyecto3": "AMIRA: Conectando con tu Bienestar",
    "info-proyecto3": "AMIRA es un asistente emocional dise帽ado para interactuar con estudiantes a trav茅s de un chat, recopilando informaci贸n clave de las conversaciones. Utiliza t茅cnicas avanzadas de an谩lisis de texto para identificar patrones relacionados con ansiedad, depresi贸n y estr茅s. Con base en estos datos, AMIRA genera un prediagn贸stico emocional, ofreciendo una herramienta innovadora para fomentar el bienestar y facilitar intervenciones oportunas en el 谩mbito educativo.",
    "buttons": {
      "view_more": "Ver m谩s",
      "view_less": "Ver menos",
      "view_image": "Ver imagen",
      "view_repo": "Ver repositorio"
    },
    "invitacion-github": "驴Te gustar铆a conocer m谩s sobre mi trabajo y descubrir otros proyectos desarrollados? Visita mi repositorio de GitHub."
  },
  "contacto": {
    "title": "Contacto",
    "subtitle": "驴Interesado en colaborar en tu pr贸ximo proyecto? Llena el siguiente formulario y te contactar茅 en breve para conversar sobre c贸mo podemos lograr tus objetivos con excelencia.",
    "text": " Cont谩ctame aqu铆",
    "btn-enviar": "Enviar mensaje"
  },
  "footer": {
    "social-text": "Tambi茅n puedes ver mis otras redes:",
    "copyright": "漏 2025 KaarJoseph. Todos los derechos reservados.",
    "developed": "Desarrollado con orgullo desde la Amazon铆a ecuatoriana. "
  }
}
